"""
Условие
Даны два целых числа. Выведите значение наименьшего из них.

"""
a = int(input("input a:"))
b = int(input("input b:"))

if a < b:
    print(a)
elif b < a:
    print(b)
else:
    print(a)
