"""
Задача «Последняя цифра числа»
Условие
Дано натуральное число. Выведите его последнюю цифру.

"""
a = int(input("input a:"))

print(a % 10)
