"""
Задача «Сумма цифр»
Условие
Дано трехзначное число. Найдите сумму его цифр.

"""
n = int(input("input n:"))

n13 = n//100

n22 = n % 100
n12 = n22//10
n11 = n22 % 10
s = n13+n12+n11
print(s)
