"""
Задача «Удаление символа»
Условие
Дана строка. Удалите из этой строки все символы @

"""
s = input("Input a string:")
s1 = s.replace('@', '')
print(s1)
