"""
Задача «Стандартное отклонение»
Условие
Дана последовательность натуральных чисел x1, x2, ..., xn. 
<...>
Определите стандартное отклонение для данной последовательности 
натуральных чисел, завершающейся числом 0.

"""
# ????????????????????????????????????????????????
s = 0
n = None
sum = 0
count = 0
X = []
q = 0
sig = 0
while n != 0:
    n = int(input("imput number:"))
    if n != 0:
        count += 1
        sum += n
    X.append(n)
s = sum / count

for i in range(0, count):
    q += (X[i]-s)**2

sig = (q/(count-1))**(1/2)

print(sig)
