"""
Задача «Ферзи»
Условие
Известно, что на доске 8×8 можно расставить 8 ферзей так, 
чтобы они не били друг друга. 
Вам дана расстановка 8 ферзей на доске, 
определите, есть ли среди них пара бьющих друг друга.
Программа получает на вход восемь пар чисел, 
каждое число от 1 до 8 — координаты 8 ферзей. 
Если ферзи не бьют друг друга, выведите слово NO, 
иначе выведите YES.

"""
K = []
for i in range(8):
    с = input("Введите координату:")
    c1 = с.split()
    K += c1
N = 8
# M = [[0]*N]*N
M = [[0 for j in range(8)] for i in range(8)]

x = 0
y = 0
xi = 0
yi = 0
y1 = 0
y2 = 0
st = ""
for i in range(1, len(K)+1):
    xi = int(K[i*2-2])-1
    yi = int(K[i*2-1])-1
    if M[xi][yi] == 1:
        st = "YES"
        break
    for y in range(0, 8):
        M[xi][y] = 1

    for x in range(0, 8):
        M[x][yi] = 1
        y1 = x+(yi-xi)
        y2 = -x+(yi+xi)
        if y1 >= 0 and y1 <= 7:
            M[x][y1] = 1
        if y2 >= 0 and y2 <= 7:
            M[x][y2] = 1


if st != "YES":
    st = "NO"
print(st)
